



INSERT INTO "solar_panel_requests" ( "status", "created_at", "creator_id", "formated_at", "moderated_at", "moderator_id", "total_power", "insolation") VALUES
('черновик',	'2025-09-19 08:00:00+00',	1,	NULL,	NULL,	NULL,	0,	4.5),
('в обработке',	'2025-09-19 09:30:00+00',	2,	'2025-09-19 10:00:00+00',	NULL,	3,	0,	5.0),
('отменен',	'2025-09-19 11:00:00+00',	1,	'2025-09-19 11:30:00+00',	'2025-09-19 12:30:00+00',	3,	0,	3.9),
('завершен',	'2025-09-19 14:00:00+00',	2,	'2025-09-19 14:10:00+00',	'2025-09-19 15:10:00+00',	3,	140.0,	3.1);


INSERT INTO "solar_panels" ("title", "type", "description", "power", "height", "width", "depth", "efficiency", "image") VALUES
('Монокристаллическая панель',	'Монокристаллическая',	'Высокоэффективная панель из монокристаллов, подходящая для ограниченных пространств.',	50,	1640, 992, 35,	'20-22',	'http://127.0.0.1:9000/images/mono.jpeg'),
('Поликристаллическая панель',	'Поликристаллическая',	'Надежная панель с хорошим соотношением цена/качество, широко используется.',	280,	1650, 998, 35,	'18-20',	'http://127.0.0.1:9000/images/poly.jpeg'),
('Тонкопленочная панель',	'Тонкопленочная',	'Гибкая и легкая панель, эффективна при рассеянном солнечном свете.',	40,	1200, 600, 6,	'12-15',	'http://127.0.0.1:9000/images/tonko.jpeg'),
('Солнечная панель премиум',	'Монокристаллическая',	'Панель премиум-класса с повышенной эффективностью и долговечностью.',	60,	1740, 1000, 40,	'21-23',	'http://127.0.0.1:9000/images/premium_mono.png');


INSERT INTO "users" ("login", "password", "is_moderator") VALUES
('ivanov',	'hashedpass1',	'0'),
('petrov',	'hashedpass2',	'0'),
('admin',	'hashedadmin',	'1');


INSERT INTO "request_panels" ("solar_panel_request_id", "solar_panel_id", "area") VALUES
(1,	1,	10.5),
(1,	3,	5.2),
(2,	2,	15.0),
(2,	1,	6.0),
(3,	4,	4.0),
(4,	2,	12.5),
(4,	3,	3.3);